INSERT INTO lib_member (m_user, m_pass, m_name, m_phone) VALUES
('member01', 'abc1111', 'สมหญิง จริงใจ', '0811111111'),
('member02', 'abc2222', 'สมชาย มั่นคง', '0822222222'),
('member03', 'abc3333', 'สมเกียรติ เก่งกล้า', '0833333333'),
('member04', 'abc4444', 'สมสมร อิ่มเอม', '0844444444'),
('member05', 'abc5555', 'สมรักษ์ สะอาด', '0855555555');

INSERT INTO lib_book (b_id, b_name, b_writer, b_category, b_price) VALUES
('B00001', 'คู่มือการสอบรับราชการ', 'สมศักดิ์ ตั้งใจ', '1', 299),
('B00002', 'แฮรี่ พอตเตอร์', 'J.K. Rowling', '2', 259),
('B00003', 'เย็บ ปัก ถักร้อย', 'สะอาด อิ่มสุข', '3', 249),
('B00004', 'เจ้าชายน้อย', 'อ็องตวน เดอ แซ็ง', '2', 355),
('B00005', 'การเขียนโปรแกรมคอมพิวเตอร์', 'กิ่งแก้ว กลิ่นหอม', '1', 329);

-- Example Borrowing Records (Illustrating different scenarios)
INSERT INTO lib_borrow_book (br_date_br, br_date_rt , b_id, m_user, br_fine) VALUES
('2021-08-20','2021-08-28','B00002','member03',25),
('2021-08-21','2021-08-22','B00001','member02',0),
('2021-08-22','2021-08-26','B00001','member02',5),
('2021-08-23','0000-00-00','B00003','member01',0),
('2021-08-23','0000-00-00','B00004','member05',0);